# რა არის ამ კოდის შედეგი
# nums = [1, 2, 3, 4, 5, 6]
# res = nums[::-1]
# print(res[2])
# ---------------------------- #


# ჩვენ მოცემული გვაქვს სია და ცვლადი, ასევე პუნქცია print-ი რომელიც გამოიტანს ცვლადის მეორე index-ს. სიის სახელია nums, ხოლო ცვლადის res. res-ში მოცემულია ის რომ res-ი უდრის nums საპირისპირო მნიშვნელობებს. უფრო კარგად რომ ავხსნა გეტყვით რომ მასში მოცემული კოდი შეინახავს nums სიას მაგრამ საპირისპირო თანმიმდევრობით. ხოლო როდესავ ჩვენ გამოვიტანთ res-ის მეორე indedx-ს ჩვენ გამოვიტანთ nums სიის ბოლოდან მეორე index-ს ანყ 4-ს რადგან index-ები იწყება 0-დან.
