# რა არის ამ კოდის შედეგი
# nums = [1, 2, 3, 4, 5, 6]
# res = nums[::-1]
# ----------------------- #


# ჩვენ მოცემული გვაქვს სია და ცვლადი, ასევე პუნქცია print-ი რომელიც გამოიტანს ცვლადის მეორე index-ს. სიის სახელია nums, ხოლო ცვლადის res. res-ში მოცემულია ის რომ res-ი უდრის nums საპირისპირო მნიშვნელობას. უფრო კარგად რომ ავხსნა გეტყვით რომ მასში მოცემული კოდი შეინახავს nums სიას მაგრამ საპირისპირო თანმიმდევრობით. ხოლო როდესაც ჩვენ გამოვიტანთ res-ის მეორე index-ს ჩვენ გამოვიტანთ nums სიის ბოლოდან მეორე index-ს ანუ 4-ე value-ს რადგან index-ები იწყება 0-დან.

