# ახსენით თუ რა არის sequence, iteration და selection.

# sequencing - ქართულად ნიშნავს თანმიმდევრობა. გამოიყენება იმისთვის რომ შექმნას თანმივდევრობა კოდში კომპიუტერისთვის და კომპიუტერმა გამოიყვანოს მნიშვნელობა კონკრეტული თანმიმდევრობა.

# iteration - ქართულად ნიშნავს გამეორებას.გამოიყენება იმისთვის რომ გაიმეოროს ერთი და იგივე კოდის ნაწილი კომპიუტერისთვის თუ რაღაც პირობა არ არის შესრულებული.

# selection - ქართულად ნიშნავს შერჩევას. გამოიყენება იმისთვის რომ კომპიუტერმა შეარჩიოს ის პასუხი იმის მიხედვით თუ რა მოიმოქმედა მომხმარებელმა.