# print() გამოიყენება, იმისთვის, რომ ტერმინალში გამოვიტანოთ კოდო, მაგალითად შევამოწმოდ შექმნილი პროგრამები ან ვიექსპირემენტოთ


# print("hello world") # string
# print(110) # integer

# text/ტექსტი = string/სტრინგი ------- "ეს არის სტრინგის მაგალითი"
# number/რიცხვი = integer/ინტეჯერი - 10, 20, 30, 40, 50, 60, 76, ...

# +  {მიმატება}
# -  {გამოკლება}
# *  {გამრავლება}
# / - //  {გაყოფა} (2 ტიპი)
# % {ნაშთის გამოსათვლელად}

# / -  ამის დახმარებით, საბოლოო პასუხს მივიღრბთ ათწილადს.
# // - ამის დახმარებით საბოლოო პასუხს მივიღებთ მთელ რიცხვს დამრგვალებულს, ჩამოშორდრება 'წერტილი' -ს შემდეგ არსებული რიცხვები {დამრგვალდება}


#print(10 + 10)
#print(50 - 20)
#print(50 * 2)
#print(100 / 5)
#print(100 // 5)

#print(7 / 3)
#print(7 // 3)

print('face' + 'book')
print('dis' + 'cord')

#  როდესაც სიტყვებს ერთმანეთზე ვამატებთ მაგას ეწოდება "კონკატიაცია"

print('hello world')
print("hello world")

# print("hello my name is dato and i'm from georgia")
# print("this is final moment, will you say 'yes' :> ")

# მონაცემთა ტიპები - string, integer, float, booLean, list...


# print("hello" + str(100))





