# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს ასაკის შეყვანას და შემდეგ განსაზღვრავს, არის თუ არა ადამიანი მცირეწლოვანი, მოზარდი თუ ზრდასრული.
# ინსტრუქციები:
#თუ ასაკი 13-ზე ნაკლებია, დაბეჭდე „მცირეწლოვანი“.
# თუ ასაკი 13-დან 19-მდეა, დაბეჭდე „მოზარდი“.
# თუ ასაკი 20-ზე მეტია, დაბეჭდე „ზრდასრული“.


User_age = int(input("თუ შეიძლება შეიყვანე შენი ასაკი: "))
if User_age < 13:
    print("შენ ხარ მცირეწლოვანი")
elif User_age  >= 13 and User_age <= 19:
    print("შენ ხარ მოზარდი")   
elif User_age > 20:
    print("შენ ხარ ზრდასრული")    
    