# მომხმარებელს სთხოვს პროდუქტზე ფასის შეყვანას და შემდეგ ადგენს ფასდაკლების ზომას. 
# ინსტრუქციები:
# თუ ფასი 50 ლარს აღემატება, 10%-იანი ფასდაკლება გამოიყენე და დაბეჭდე საბოლოო ფასი.
# თუ ფასი 20 ლარიდან 50 ლარამდეა, 5%-იანი ფასდაკლება გამოიყენე და დაბეჭდე საბოლოო ფასი.
# თუ ფასი 20 ლარზე ნაკლებია, ფასდაკლება არ გამოიყენება.
 
Item_cost = int(input("Please input item cost: "))
if Item_cost > 50:
    print(int(Item_cost * 0.9))
elif Item_cost >= 20 and Item_cost <= 50:    
    print(int(Item_cost * 0.95))
elif Item_cost < 20:
    print(int(Item_cost))