# შექმენით სია, სადაც იქნება შეტანილი 10 სხვადასხვა მონაცემთა ტიპის მქონე მნიშვნელობა, თქვენი დავალებაა, რომ ამ 10 მნიშვნელობიდან, პირველი 3 მნიშვნელობა გამოიტანოთ ინდივიდუალურად ტერმინალში, მეორე სამი მნიშვნელობა უნდა შეცვალოთ სხვადასხვა მნიშვნელობებით(მაგ: პროგრამირების ენებით). როდესაც ელემენტებს გამოიტანთ ცალკე და შემდეგ შეცვლით სხვა მნიშვნელობებით, მაშინ უკვე თქვენ უნდა დაამატოთ კიდევ 5 ახალი მნიშვნელობა სიაში.

list = {55, "goa", "group", True, False, 55.55, "super", 100, "hi"}

print(list[1])
print(list[2])
print(list[3])

list[4] = "Python"
list[5] = "PHP"
list[6] = "Java"

list += ["bombastic side eye"]
list += ["criminal side eye"]
list += ["o-0"]
