# What is the output of this code:
# ---------------------------------

nums = [2, 4, 8, 9, 5] # მოცემული გვაქვს სია შემდეგი მნიშვნელობებით: 2, 4, 8, 9, 5.
nums.insert(1, 3) # კომპიუტერი სია "nums"-ში სვამს რიცხვ 3-ს ერთ index-ზე
nums.remove(9) # კომპიუტერი სია "nums"-იდან შლის პირველ რიცხვ ცხრას.
nums.insert(0, nums.count(8)) # კომპიუეტრი სია "nums"-ში სვამს სია "nums"-ში არსებული რვიანების რაოდენობის აღმნიშვნელ რიცხვს ნულ index-ზე.
print(nums[3]) # კომპიუტერი ტერმინალში იტანს სია "nums"-ის სამ index-ში არსებულ მნიშვნელობას.
# პასუხი: 4